docs/internal/planarPoiseuille/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          40;
        startFace       39;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-0.2 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          40;
        startFace       79;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (0.2 0 0);
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       119;
    }
    centreline
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1;
        startFace       120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80;
        startFace       121;
    }
)

// ************************************************************************* //
